<<%@ include file="../common/IncludeTop.jsp"%>

<html>

<head>
  <%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
  <link rel="preconnect" href="https://fonts.googleapis.com">
  <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
  <link href="https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+KR:wght@600;700&family=Noto+Sans+KR:wght@300;700&display=swap" rel="stylesheet">

  <style>
    @import url('https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+KR:wght@600;700&family=Noto+Sans+KR:wght@300;700&display=swap');
  </style>

  <style>
    .p1{
      font-family: 'Noto Sans KR', sans-serif;
    }
    .p2 {
      font-family: 'Jua', sans-serif;
    }
    .p3{
      font-family: 'IBM Plex Sans KR', sans-serif;
    }
  </style>

  <style>
    .button {
      font-family: 'Jua', sans-serif;
      border-top-left-radius: 5px;
      border-top-right-radius: 5px;
      border-color: lightgray;
      padding: 20px;
      text-align: center;
      text-decoration: none;
      display: inline-block;
      font-size: 20px;
      margin: 4px 2px;
      cursor: pointer;
    }
    .rho{
      border-radius: 14px;
      font-family: 'Jua', sans-serif !important;
      color: white !important;
      background-color: grey;
    }
    .rho:hover{
      border-radius: 14px;
      font-family: 'Jua', sans-serif !important;
      color: white !important;
      background-color: darkgray;
    }

  </style>
</head>

<body>
<div style="text-align: center">
  <img src="../images/fish_edu_btn.png" style="margin-left: auto; margin-right: auto; display: block;"/>
</div>

<div style="text-align: center; padding-top: 5px" class="p1">
  <h2 style="color:gray;display: block; margin-right: auto; margin-left: auto; border-style: double none double none; width:500px; padding-top:10px; padding-bottom: 10px;"> <strong>
    " 물고기 " 입양 전 알아야 하는 것
  </strong> </h2>
</div>
<form action="">
  <div style="height: auto; width: 90%; border:7px solid grey; border-radius: 1em; display: block; margin-right: auto; margin-left: auto; text-align: center;" class="p1">
    <br>
  물고기는 인기있는 반려동물입니다.<br>

    물고기를 입양하기로 결정하였다면 물고기의 습성과 특성을 이해하여야 합니다. <br><
    반려물고기와 편안하고 행복한 생활을 하고 싶다면 다음과 같은 사항을 참고하여 반려물고기를 키우는 것이 좋습니다.<br>

    물고기는 종마다 사육환경이 천차만별입니다. <br>
    따라서 입양을 결정한 물고기의 사육환경에 대해 별도로 찾아보고 이해한 후 입양을 진행하여야 합니다.<br>

    또한 물고기의 종마다 취약한 질병이 달라 내가 입양을 결정한 물고기가 어떤 질병에 취약한지 치료방안은 무엇인지 공부하는 것이 필수적입니다.<br>

    또한 물고기 입양 전 어항 및 어항 속 물에 대한 준비과정을 이해하고 , 모든 준비가 완료되어야 합니다.<br>

    <br> [민물어항 설치하는 법]<br><br>

    1. 어항을 놓을 위치를 정하고 받침대와 어항을 세팅합니다.<br>
    2. 수평기를 사용하여 어항과 바닥의 수평을 맞춥니다. 수평이 맞지 않으면 어항이 터질 수 있으니 주의하여야 합니다.<br>
    3. 수조에 물을 가득 채운 다음 물이 새는지, 그리고 물을 채우면서 수평이 틀어지는지 확인합니다. <br>
    확인이 끝나면 물을 모두 빼냅니다.<br>
    4. 지면여과기를 활용하려 하면 필요한 넓이만큼 저면판을 깔아줍니다. <br>
    순환용 에어호스나 수중모터 역시 연결해줍니다.<br>
    5. 여과기와 부속 자재 등 물이 통과하는 부품을 연결하고 필요시 히터를 배치합니다.<br>

    6. 여과기, 수류모터 등을 풀가동해 물이 새는곳이 있는가 확인합니다. 24시간 정도로 충분히 확인합니다.<br>
    7. 모든 전원을 분리하고 다시 물을 모두 빼냅니다.<br>
    8. 수초어항을 계획중이고 밑거름으로 고체형 비료를 사용하려 할 때에는 바닥재의 반과 비료를 잘 섞어서 어항 바닥에 깝니다.<br>
    9. 나머지 바닥재를 어항 바닥에 잘 깔아줍니다. 이 때 어항의 앞부분은 얕게, 어항의 뒷부분은 깊게 깔아주면 입체감이 생깁니다.<br>
    10. 장식품을 배치합니다. 이 단계에서 수초를 미리 심어도 좋습니다.<br>
    11. 물을 다시 한 번 가득 채웠다가 빼냅니다. <br>
    바닥재를 설치한 상태에서 물을 채울 때에는 바닥재 위에 비닐봉지를 깔고 그 위에 그릇을 하나 올린 다음 바닥재가 패이지 않도록 그릇을 겨냥해 물을 살살 부어주면 좋습니다. <br>
    미세분진과 여분의 비료성분을 제거하는 과정입니다.<br>
    12. 이제 어항에 물을 넣어주는 과정으로 넘어갑니다.<br>

    <br>[해수어항 설치하는 법]<br><br>

    기본적으로 해수어항의 소금물은 부식성이 강해 색깔이 들어간 플라스틱 장식품 등은 해수어항에 넣으면 안됩니다.<br>

    1. 여과기나 부속 자재 및 수류모터, 히터, 스키머 등을 설치할때까지는 민물어항과 별다른 차이는 없습니다. <br>
    누수테스트는 민물로 충분히 진행합니다.<br>
    2. 바닥재를 깔아줍니다.<br>
    3. 데드락 또는 라이브락을 배치합니다. <br>
    데드락은 해수를 붓기 전에 미리 배치해도 상관없으며, 사전에 한 번 정도는 삶고 햇볕에 말려서 혹시 모를 이물질이나 성분을 제거해 주는게 좋습니다. <br>
    라이브락의 경우엔 해수를 붓고 난 후에 넣어줘야 하니 순서에 주의합니다. <br>
    또한 라이브락은 온도차이가 너무 심하면 락 내부의 미생물이 몰살당할 수 있으므로 온도를 어느정도 맞춰줘야 합니다.<br>
    4. 민물에 해수염을 타서 비중을 맞춘 해수를 준비해 바닥재가 패이지 않도록 살살 부어줍니다. <br>
    해수의 비중은 1.023~1.025가 일반적입니다.<br>
    5. 여과기, 수류모터 등을 풀가동해 물이 새는곳이 있는가, 수류가 어항 구석구석을 모두 순환하는가 재차 확인합니다.<br>
    역시 24시간 정도로 재차 충분히 확인합니다.<br>
    6. 이제 어항에 물을 넣어주는 과정으로 넘어갑니다.<br>

    [어항에 넣을 물을 준비하는 과정, ‘물잡이’]<br>

    어항을 셋팅하고 물을 붓는다고 바로 물고기를 투입할 수 있는 것이 아닙니다.<br>
    어항 내부에 암모니아와 아질산염같이 물고기에게 매우 치명적인 물질을 정화시킬 박테리아가 먼저 자리잡아야 합니다.<br>
    <br>
    이러한 박테리아들이 여과재나 바닥재 등등에 자리잡게 만드는 작업을 ‘물잡이’라고 일컫습니다. <br>
    만약 어항에 물을 부은 직후에 바로 물고기를 투입하면 어지간한 강종이 아닌 이상은 버텨내지 못하고 죽게 됩니다.<br>

    때문에 깨끗히 씻은 어항에 물을 채우고 셋팅을 한 다음 적정량의 박테리아제와 기타 약품을 넣고 기한을 둔 다음 물고기를 투입해야 합니다.<br>

    개체에 따라 다르지만 담수어항의 경우 약 1개월, 해수어항의 경우 약 2~3개월 정도가 소요됩니다.<br>

    막구피나 제브라다니오 같은 강한 어종을 초기에 투입하여 체외배설물(점액질, 또는 배변)을 통해서 암모니아를 발생시켜 생물학적 여과사이클을 자리잡게 하는 방법도 있습니다.<br>

    물잡이를 할 때 넣는 물은 일반적으로 염소를 제거한 수돗물인데, 거주지의 환경에 따라서는 녹물이나 과도한 염소를 필터해주는 정수기를 설치해서 사용하기도 합니다.<br>
    해수의 경우에는 담수와 달리 미량원소가 해수염에 이미 포함되어 있어서 수돗물을 그냥 사용하면 어항이 부영양화 되는 경우가 많다보니 항상성과 원수통제 측면에서 정수기 물이 필수인데, RO/DI 필터를 기반으로 물을 증류수 수준으로 여과하여 사용하는 경우가 많습니다.<br>
    단순히 해수어만 키우는 F/O어항에서 굳이 정수기물을 사용할 필요는 없습니다.<br>

    <br>[민물어항의 물잡이]<br><br>

    약 1개월 정도 걸립니다.<br><br>

    1. 수족관을 세팅하고 물을 채웁니다. 물고기를 바로 투입하는 것은 권장되지 않습니다.<br>
    2. 최소한 하루 정도는 빈 수족관에서 여과기를 가동해 물을 순환시켜줍니다.<br>
    3. 박테리아제를 권장사용량만큼 넣거나 주기적으로 물고기 밥을 뿌려서 어항에 유기물이 썩어 암모니아가 생길 환경을 만들어 줍니다.<br>
    4. 굳이 박테리아제를 넣어주지 않더라도 물잡이가 잘 되어있는 어항 여과기의 스펀지를 짜서 나오는 찌꺼기를 어항에 부어줘도 됩니다. <br>
    실제로도 상당수가 물잡이용으로 사용하는 방법입니다.<br>
    5. *Nitrosomonas*가 번식하여 암모니아를 아질산염으로 변환시킵니다. 이 때 물이 뿌옇게 흐려지는 백탁이 쉽게 옵니다. 매일 하루 정도 재운 수돗물로 어항 물의 3분의1 정도를 갈아줍니다. <br>
    여기까지 약 1~2주 걸립니다.<br>
    6. *Nitrobacter*가 정착하여 아질산염을 독성이 적은 질산염으로 변환시킵니다. <br>
    이 단계가 되면 뿌옇던 물이 다시 투명해집니다. 어항을 설치한 직후의 창백한 투명함과는 달리 물이 생기를 띄었다는 느낌을 받습니다. <br>
    눈으로 보면 충분히 알 수 있다습니다. 여기까지 약 3~4주가 걸립니다. 이 단계가 되면 물잡이가 완료되었다고 보아도 좋습니다.<br>
    7. 이후로는 2주~1개월에 한 번 부분물갈이로 어항 물의 3분의1 정도를 갈아주면 충분합니다.<br>
    8. 어항 물을 완전히 바꾸는 전체물갈이를 할 때에는 물잡이 과정을 처음부터 다시 시작해야 합니다. <br>
    여과재를 어항물에 살살 헹구어낸 찌꺼기나 스펀지여과기를 주물러 짠 시커먼 국물을 보관해 두었다가 전체물갈이 후 투입해주면 물잡이 기간을 단축할 수 있습니다.<br>
    9. 물고기를 추가로 투입한 이후 백탁이 온다면 '아질산염 단계'부터 다시 시작합니다. <br>
    어항 물이 충분히 안정되어 있다면 백탁이 빠르게 사라지고 다시 투명한 물을 볼 수 있습니다. <br>
    바닥재에 따라서 다르지만 백탁이 지나치게 자주 발생하는 것은 물고기를 과밀사육한다는 증거입니다.<br>
    10. 물갈이 후 백탁이 오면 *Nitrosomonas* 와 *Nitrobacter*의 균형이 깨진 것입니다. <br>
    지금까지 별 이상 없이 수족관을 관상하고 있었다면 '아질산염 단계'부터 다시 시작해주면 빠른 시일 안에 물이 다시 균형 잡힐 가능성이 높습니다.<br>
    11. 물고기만 사육할 때보다는 수초와 함께 사육할 때 물의 균형이 보다 안정적으로 잡히는 경우가 많습니다. <br>
    다만 수초는 수질을 산성 쪽으로 기울게 하며 알칼리성 물에서는 잘 성장하지 못하기 때문에 알칼리성 수질을 선호하는 어종과는 함께 기르기 힘듭니다<br>

    <br>[해수어항의 물잡이]<br><br>

    정석대로, 안정적으로 물잡이를 하게 되면 짧게는 2개월에서 6개월 정도 걸립니다. 라이브락을 사용하게 되면 일반적으로 2개월~3개월의 시간이 소요됩니다.<br>

    1. 어항을 세팅이 끝나면 히터를 틀어 수온을 26도 정도로 맞춥니다. <br>
    (냉수어를 키울 경우엔 설치를 하지 않거나 냉각기를 설치해서 약 18도 미만으로 유지해야 합니다.)<br>
    2. 리턴모터, 수류모터, 스키머, 조명, 히터, 쿨러 등을 모두 가동해줍니다. <br>
    만약 스키머를 쓰지 않는 소형 F/O 어항이라면 기포발생기를 별도로 설치해서 어항 내에 산소가 원활히 공급되게 유도합니다. <br>
    분진을 포집하는 장치를 같이 넣어주면 좋습니다. 물고기를 기를 때와 동일한 조건으로 강한 조명을 하루에 8~10시간 틀어줍니다.<br>
    3. 분진이 모두 잡혀 물이 투명해지면 기포발생기를 제거합니다.<br>
    4. 수질 체크 장비로 암모니아와 아질산염이 뜨는지 테스트를 먼저 해본 후 이어서 질산염 수치와 Ph도 체크를 해 줍니다. <br>
    암모니아와 아질산염이 둘 다 완전히 검출되지 않고, 질산염이 매우 낮게 검출되는 동시에 Ph도 8.0~8.3 수준을 보인다면 생물을 투입 할 준비가 끝났다고 봐도 무방합니다. <br>
    만약 산호도 키울 예정이라면 경도, 칼슘, 마그네슘도 주기적으로 체크해줘야 합니다.<br>
    5. 해수어항은 민물어항에 비해 훨씬 물의 균형이 쉽게 깨집니다. <br>
    생물을 투입 할 때는 절대로 한 번에 다수를 넣으면 안됩니다. <br>
    1주일 정도의 텀을 두고 순차적으로 1~2마리씩 넣어야지 어항 내 여과 용적에 과부하가 걸리지 않고 투입된 생물에 맞춰서 서서히 확장됩니다. <br>
    또한 맨손을 어항에 넣거나 한꺼번에 다량의 물갈이를 하는 것도 피해야 합니다.<br>

    [담수어항에 같이 기르는 생물]<br>

    1. 생이새우 - 이끼제거와 남은 먹이 처리를 위해 키웁니다.<br>
    2. 왜생이 - 일본과 대만 원산으로 주로 이끼제거를 목적으로 키웁니다.<br>

    [해수어항에 같이 기르는 생물]<br>

    1. 산호 - 해수용 조명이 없어도 키울 수 없습니다. <br>
    기르는 산호에 따라서 따로 먹이를 급여해야 기를 수 있습니다.<br>
    2. 말미잘 - 사육난이도가 높은 생물입니다. <br>
    생먹이 급여가 필요하고 수질에 민감힙니다.<br>
    3. 고둥 - 어항 청소에 도움이 되는 생물입니다. <br>
    소라게와 합사할 경우 소라게가 고둥을 사냥할 수 있어 주의해야 합니다.<br>
    4. 집게 - 어항 청소에 도움이 되는 생물입니다. <br>
    고둥과 합사할 경우 집게가 고둥을 사냥할 수 있어 주의해야 합니다.<br>
    5. 성게 - 어항 청소에 도움이 되는 생물입니다. <br>
    산호와 합사할 경우 성게가 산호를 잡아먹을 수 있어 주의해야 합니다.<br>

    <br>[어항 청소]<br><br>

    이끼 등이 오거나 어항 바닥이 더러워질 때 물갈이때 살살 뽑아내 주는 정도로 충분합니다. <br>
    어항물이 투명하게 유지되고 냄새가 나지 않는다면 굳이 청소를 하지 않아도 무방합니다. <br>
    여과기 등이 막히는 것에 대비해 가끔 물리적 여과재만 빨아주는 것으로 충분합니다.<br>

    1. 여과기 청소 - 절대 세제를 사용하여 청소하면 안됩니다. 여과기의 종류에 다라 다르지만, 대부분 적당히 수돗물에 넣고 헹구면 충분합니다.<br>
    2. 유막 청소 - 유막은 어항에 생기는 기름층으로 이게 생기면 미관상으로도 좋지 않고 수질이 쉽게 더러워져서 아래쪽의 생물들에게도 좋지 않습니다. <br>
    특히 유막은 수면으로 오는 산소를 차단하기 때문에 빨리 청소하는 게 좋습니다. <br>
    유막은 원인을 제대로 해결하지 못하면 계속 생기므로 유막이 생기는 원인을 일단 알아야 합니다. <br>
    보통 먹이가 너무 많이 투입되었거나, 수류 부족, 용존산소 부족, 박테리아 문제 등으로 다양합니다. <br>
    가장 빠르고 간편한 방법은 유막제거기를 설치하고 여과기 출수구나 걸이식 여과기 등 표면 수류를 일으킬 수 있는 장치로 표면에 수류를 지속적으로 일으켜 주는 것입니다. <br>
    커피여과지 같은 여과지 여러 장을 수면에 얹어주고 좀 기다렸다가 제거해주거나, 키친타올을 수면에 올려두고 유막이 제거될 때까지 기다려주는 방법도 있습니다.<br>
    3. 스키머 청소 - 포집된 유기물을 정기적으로 비워주고 각종 파이프가 막히지 않도록 주기적으로 내부청소를 해주면 됩니다.<br>
    4. 이끼 청소 - 벽면에 이끼가 끼어 있으면 관상이 힘들어집니다. 부드러운 스펀지나 이끼 닦개 등을 이용해 어항 전면을 깨끗이 닦아줍니다. <br>
    부분물갈이와 병행해 닦여진 이끼를 물과 함께 빨아내 버리는 것도 좋은 선택입니다. <br>
    이끼가 창궐하기 시작하면 완전히 제거하기란 사실상 불가능합니다. <br>
    언제든 방심하면 이끼 포자가 날아들어 어항을 점령해 버립니다.<br>

    어항을 청소하면서 불가피하게 락스 또는 세제로 어항 부속품을 청소했다면 반드시 맑은 물에 24시간 담가두어 락스 성분을 모두 제거한 뒤 다시 어항 속에 배치하여야 합니다.<br>

    <br>[먹이]<br><br>

    어종에 따라서 아무것이나 잘 먹는 어종부터 살아있는 것만 먹는 어종, 식물성 먹이를 선호하는 어종 등 다양합니다.<br>
    자신이 기르는 어종에 맞는 먹이를 급여하는 것이 자신이 좋아하는 반려물고기를 건강하게 기르는 비결 중 하나입니다. <br>
    먹이는 조금 부족하다 싶은 정도로 급여하는 것이 좋습니다. <br>
    먹이를 너무 많이 주어 모두 섭취하지 못하고 바닥에 쌓이면 남은 먹이가 부패하여 수질을 급격하게 악화시킵니다. <br>
    물고기는 변온동물이고 대사량이 크지 않아 일주일 정도 굶어도 건강히 잘 살아갑니다. <br>
    다만 종에 따라 대사량이 많아 일주일 씩이나 굶기면 위험한 종도 있습니다. <br>
    치어는 성어보다 소화시간이 짧기 때문에 조금 자주 주는 것이 좋습니다.<br>

    1. 플레이크형 사료 : 종잇장처럼 얇은 사료입니다. <br>
    물 위에 떠서 잘 가라앉지 않습니다. <br>
    수면 근처에 사는 어종에게 적합합니다. <br>
    종이장처럼 얇기 때문에 잘 부서지고, 물에 젖으면 종이처럼 흐물흐물해지기 때문에 소형어종이 섭취하기에 적합합니다. <br>
    물에 가라앉게 따로 컵에 넣어 물을 넣고 흔들어 주어도 좋습니다.<br>
    2. 과립형 사료: 물에 뜨는 종류와 물에 가라앉는 종류가 있습니다. <br>
    바닥에서 먹이를 찾는 어종에게는 가라앉는 형태의 사료가 좋습니다.<br>
    3. 타블렛형 사료: 알약처럼 생긴 사료입니다. <br>
    대형어에게 급여하거나 어항 벽면에 붙여 비파 등에게 급여하는데 씁니다.<br>
    4. 냉동건조 사료: 새우나 장구벌레 등을 냉동건조하여 보존한 사료입니다. <br>
    육식, 잡식성 어종이 잘 먹는 편입니다.<br>
    5. 냉동먹이: 새우, 장구벌레 등을 통째로 얼린 먹이입니다. <br>
    육식성 어종이 매우 좋아합니다. 급여 방법은 먼저 물을 담은 그릇에 넣어 녹인 뒤 급여하는 것입니다. <br>
    제대로 녹지 않았을 경우 탈이 날 수도 있으니 주의하여야 합니다.<br>
    6. 생먹이: 살아있는 생물을 직접 먹이로 급여하는 것입니다. <br>
    물벼룩, 아르테미아 유생, 새우, 올챙이, 작은 물고기 등을 산 채로 어항에 투입해 잡아먹도록 합니다.<br>
    7. 자급자족 : 수초어항 등에서 잘 번식하는 새우와 같은 생물을 함께 길러서 새우의 새끼를 물고기가 잡아먹도록 하는 방법입니다. <br>
    실제로 균형이 잘 잡힌 수초어항은 한 달 가까이 먹이를 급여하지 않기도 합니다.<br>

    <br> [유해생물 관리]<br><br>

    1. 거머리 - 물고기의 피를 빨아먹습니다. <br>
    개체수가 적을 경우 그물로 건져낸다. 개체수가 많을 경우 별도의 어항을 준비하여 생물을 옮기고 넣고 본 어항을 청소한다<br>
    2. 유해곤총( 물방개, 장구애비 등) - 물고기나 새우를 공격해 잡아먹습니다. <br>
    어항 내에서 번식을 잘 하지 않기 때문에 별도의 어항을 준비 할 필요 없이 곤충만 그물로 건져내서 죽입니다.<br>
    3. 플라나리아 - 새우에게 치명적인 생물입니다. <br>
    사람의 눈에 발견되기 시작하면 이미 그 어항에는 많은 수의 플라나리아가 번식해서 여기저기 서식하고 있다는 뜻입니다. <br>
    플라나리아는 약품으로 제거하는 것이 사실상 불가능하며 가장 확실하는 방법은 별도의 어항을 준비하여 생물을 옮기고 본 어항을 청소하는 것입니다.<br>
    4. 히드라 - 플라나리아와 달리 새우 뿐 아니라 치어,달팽이, 유익생물 등에게도 치명적입니다. <br>
    수질이 좋지 않은 경우 발생합니다. 플라나리아와 비슷하게 제거 난이도가 높은 편이다. <br>
    별도의 어항을 준비하여 생물을 옮기고 본 어항을 청소해야 합니다.<br>
    5. 남세균(시아노박테리아) - 발견 즉시 어항 속 바닥재, 수초를 버리고 어항 부속품들을 세척한다. <br>
    그럼에도 불구하고 계속 발생한다면 본 어항을 전부 청소해야 합니다. <br>
    인체에 치명적인 독성물질을 배출하기 때문에 즉각 처리하여야 합니다.<br><br>

  </div>
  <div style="text-align: center;" class="p3">
    <br>*다음 페이지는 위 교육에 대한 테스트 페이지 입니다. 총 10문항으로, 문항 당 배점 기준은 다음과 같습니다.*<br><br>

    1-5번 : 매우그렇다 (5점) 그렇다 (4점) 보통이다 (3점) 그렇지 않다(2점) 전혀 그렇지 않다 (1점)<br>

    6-10번 : 정답을 고를 시에 5점, 오답을 고를 시에 0점<br><br>

    총점 40점 이상이 되면 테스트 합격으로 입양 절차가 진행됩니다.<br><br>

    *불합격 하신 경우 재교육과 재시험이 필요합니다.*<br><br>

  </div>
  <div style="text-align: center">
    <stripes:link
            beanclass="org.mybatis.jpetstore.web.actions.EducationActionBean"
            event="viewTest">
      <stripes:param name="type" value="FI" />
      <img src="../images/test_start.png" style="margin-left: auto; margin-right: auto; display: block;"/>
    </stripes:link>
  </div>
</body>
</html>
<%@ include file="../common/IncludeBottom.jsp"%>